gdgly/NUC97X_JS/STM32F4xx/CSG/TerminalCSG/Terminal_Init.c
	Pin_Configure(PIN_BV7_A5V,	//电压检测，模拟输入
					0|//B3-B0:复用功能选择AF(0-15)
		 (3<<4)|//B5-B4:模式:00：输入（复位状态）,01：通用输出模式,10：复用功能模式,11：模拟模式
		 (0<<6)|//B6   :输出类型:0：输出推挽（复位状态）,1：输出开漏
		 (0<<7)|//B8-B7:输出速度:00：2 MHz（低速）,01：25 MHz（中速）,10：50 MHz（快速）,11：30 pF 时为 100 MHz（高速）（15 pF 时为 80 MHz 输出（最大速度））
		 (0<<9)|//B10-B9:上拉/下拉:00：无上拉或下拉,01：上拉,10：下拉,11：保留
		 (0<<11));//B11  :当为输出时：0=输出0,1=输出1
	Pin_Configure(PIN_BV6_V4V8,//电压检测，模拟输入
					0|//B3-B0:复用功能选择AF(0-15)
		 (3<<4)|//B5-B4:模式:00：输入（复位状态）,01：通用输出模式,10：复用功能模式,11：模拟模式
		 (0<<6)|//B6   :输出类型:0：输出推挽（复位状态）,1：输出开漏
		 (0<<7)|//B8-B7:输出速度:00：2 MHz（低速）,01：25 MHz（中速）,10：50 MHz（快速）,11：30 pF 时为 100 MHz（高速）（15 pF 时为 80 MHz 输出（最大速度））
		 (0<<9)|//B10-B9:上拉/下拉:00：无上拉或下拉,01：上拉,10：下拉,11：保留
		 (0<<11));//B11  :当为输出时：0=输出0,1=输出1
	Pin_Configure(PIN_BV5_V3V6,//电压检测，模拟输入
					0|//B3-B0:复用功能选择AF(0-15)
		 (3<<4)|//B5-B4:模式:00：输入（复位状态）,01：通用输出模式,10：复用功能模式,11：模拟模式
		 (0<<6)|//B6   :输出类型:0：输出推挽（复位状态）,1：输出开漏
		 (0<<7)|//B8-B7:输出速度:00：2 MHz（低速）,01：25 MHz（中速）,10：50 MHz（快速）,11：30 pF 时为 100 MHz（高速）（15 pF 时为 80 MHz 输出（最大速度））
		 (0<<9)|//B10-B9:上拉/下拉:00：无上拉或下拉,01：上拉,10：下拉,11：保留
		 (0<<11));//B11  :当为输出时：0=输出0,1=输出1
	Pin_Configure(PIN_BV3_V5V,//电压检测，模拟输入
					0|//B3-B0:复用功能选择AF(0-15)
		 (3<<4)|//B5-B4:模式:00：输入（复位状态）,01：通用输出模式,10：复用功能模式,11：模拟模式
		 (0<<6)|//B6   :输出类型:0：输出推挽（复位状态）,1：输出开漏
		 (0<<7)|//B8-B7:输出速度:00：2 MHz（低速）,01：25 MHz（中速）,10：50 MHz（快速）,11：30 pF 时为 100 MHz（高速）（15 pF 时为 80 MHz 输出（最大速度））
		 (0<<9)|//B10-B9:上拉/下拉:00：无上拉或下拉,01：上拉,10：下拉,11：保留
		 (0<<11));//B11  :当为输出时：0=输出0,1=输出1
	Pin_Configure(PIN_BV1_E3V3,//电压检测，模拟输入
					0|//B3-B0:复用功能选择AF(0-15)
		 (3<<4)|//B5-B4:模式:00：输入（复位状态）,01：通用输出模式,10：复用功能模式,11：模拟模式
		 (0<<6)|//B6   :输出类型:0：输出推挽（复位状态）,1：输出开漏
		 (0<<7)|//B8-B7:输出速度:00：2 MHz（低速）,01：25 MHz（中速）,10：50 MHz（快速）,11：30 pF 时为 100 MHz（高速）（15 pF 时为 80 MHz 输出（最大速度））
		 (0<<9)|//B10-B9:上拉/下拉:00：无上拉或下拉,01：上拉,10：下拉,11：保留
		 (0<<11));//B11  :当为输出时：0=输出0,1=输出1
		 
	MC(0,ADDR_TerminalRealTimer,1);						// 0 = 掉电时间未计算, 1 = 掉电时间已计算
	pTerminalRam->SlipCYC_S_Timer = 60;					// 23 终端输入脉冲功率计算和需量脉冲滑移秒定时器
	pTerminalRam->Power_S_Timer = 10;					// 38 停电事件秒定时器
	p16 = (u16 *)Get_ADDR_UARTnTimer_S(RS485_1PORT);
	p16[0] = 10;										// 10秒上电后延时抄表
	p16 = (u16 *)Get_ADDR_UARTnTimer_S(RS485_2PORT);
	p16[0] = 10;										// 10秒上电后延时抄表
	p16 = (u16 *)Get_ADDR_UARTnTimer_S(PLC_PORT);		// (集中器载波,专变控制模块)
	p16[0] = 10;										// 10秒上电后延时抄表
	p16 = (u16 *)(Get_ADDR_UARTnTimer(ENETPORT));
	p16[0] = 2000/10;									// 上电时置关机延时2s作为LED亮灯检查

	pTerminalRam->RS485_1_TxLED_MS_Timer=2000/10;		// 10 RS485_1抄表发送LED指示MS定时器,每10MS减1定时器
	pTerminalRam->RS485_1_RxLED_MS_Timer=2000/10;		// 11 RS485_1抄表接收LED指示MS定时器,每10MS减1定时器
	pTerminalRam->RS485_2_TxLED_MS_Timer=2000/10;		// 12 RS485_2抄表发送LED指示MS定时器,每10MS减1定时器
	pTerminalRam->RS485_2_RxLED_MS_Timer=2000/10;		// 13 RS485_2抄表接收LED指示MS定时器,每10MS减1定时器
	pTerminalRam->ENETLED_MS_Timer = 2000/10;			// 14 以太网接收发送LED指示MS定时器,每10MS减1定时器
	#if (Project/100) == 3
		pTerminalRam->ContrlLoopCheck_S_Timer=60;		// 36 控制输出回路检测有效等待秒定时器
	#endif
	pCommRam->CheckLEDTimer = 3000/10;					// 上电全部LED检查显示 每10MS减1定时器

#if (TEST_ON == 1)//err20180626 上电后就同步节点状态C0F至RAM，避免产生遥信变位告警

	pstCtrl_Param_Info = (LoadManagementParaStruct*)QCSG_CTRL_PARAM_INFO;
	pstCtrl_Info = (QCSG_CTRL_INFO_S*)QCSG_CTRL_INFO;
	pstE2000039_Alarm_Info = (QCSG_ALARM_E2000039_INFO_S*)QCSG_ALARM_E2000039_LIST;	
	u32ReadLen = 0;

	if(NAND_ReadPara(PARA_LoadManagement,0,0xE0000C00,(u8*)pstCtrl_Param_Info,&u32ReadLen) == NO_ERROR)
	{
		//更新遥信开关属性
		//err20181101 增加门节点上电同步状态。
		if((pstCtrl_Param_Info->SwitchNodeType[0] != 0x00) && (pstCtrl_Param_Info->SwitchNodeType[0] != 0x01))
		{
			pstCtrl_Info->u8Switch0Attr = 0x00;
		}
		else
		{
			//if(pstCtrl_Info->u8Switch0Attr != pstCtrl_Param_Info->SwitchNodeType[0])
			//{
			//	pstCtrl_Info->u32Switch0Timeout = u32CurrTick + 30 * 100;
			//}
			pstCtrl_Info->u8Switch0Attr = pstCtrl_Param_Info->SwitchNodeType[0];
		}
		//更新遥信开关属性
		if((pstCtrl_Param_Info->SwitchNodeType[1] != 0x00) && (pstCtrl_Param_Info->SwitchNodeType[1] != 0x01))
		{
			pstCtrl_Info->u8Switch1Attr = 0x00;
		}
		else
		{
			pstCtrl_Info->u8Switch1Attr = pstCtrl_Param_Info->SwitchNodeType[1];
		}
		if((pstCtrl_Param_Info->SwitchNodeType[2] != 0x00) && (pstCtrl_Param_Info->SwitchNodeType[2] != 0x01))
		{
			pstCtrl_Info->u8Switch2Attr = 0x00;
		}
		else
		{
			pstCtrl_Info->u8Switch2Attr = pstCtrl_Param_Info->SwitchNodeType[2];
		}
		if((pstCtrl_Param_Info->SwitchNodeType[3] != 0x00) && (pstCtrl_Param_Info->SwitchNodeType[3] != 0x01))
		{
			pstCtrl_Info->u8Switch3Attr = 0x00;
		}
		else
		{
			pstCtrl_Info->u8Switch3Attr = pstCtrl_Param_Info->SwitchNodeType[3];
		}
		if((pstCtrl_Param_Info->SwitchNodeType[4] != 0x00) && (pstCtrl_Param_Info->SwitchNodeType[4] != 0x01))
		{
			pstCtrl_Info->u8Switch4Attr = 0x00;
		}
		else
		{
			pstCtrl_Info->u8Switch4Attr = pstCtrl_Param_Info->SwitchNodeType[4];
		}
		//更新告警Flag信息 防止上电报遥信变位告警
		pstE2000039_Alarm_Info->u8Alarm1Flag = pstCtrl_Info->u8Switch1Attr;
		pstE2000039_Alarm_Info->u8Alarm2Flag = pstCtrl_Info->u8Switch2Attr;
		pstE2000039_Alarm_Info->u8Alarm3Flag = pstCtrl_Info->u8Switch3Attr;
		pstE2000039_Alarm_Info->u8Alarm4Flag = pstCtrl_Info->u8Switch4Attr;
	}

#endif

}

#endif

#if ((Project/100)==5)	// II 型集中器

void On38KHz(void);//开38KHz时钟(TIM3_CH3)
void Init_Terminal(void)//启动初始化
{
	MeterFileInfoStruct* MeterFileInfo = (MeterFileInfoStruct*)ADDR_MeterFileInfo;
	Terminal_Ram_TypeDef* pTerminalRam = Terminal_Ram;
	Comm_Ram_TypeDef* pCommRam = Comm_Ram;

	JZQ_II_GeneralGPIOInit();
	if(pCommRam->POWER < 3)	return;		// 电源:0=电池供电,1=电网供电转电池供电重启动,2=电网供电转电池供电,3=电网供电

	Terminal_UartInit_Manage();			
	Terminal_Reset_Count();
	CH_AMR_TaskCtrlDataValidCheck(RS485_1PORT);
	CH_AMR_TaskCtrlDataValidCheck(RS485_2PORT);
	//CH_AMR_TaskCtrlDataValidCheck(PLC_PORT);
	pTerminalRam->MeterSyncToRam_S_Timer = 0;
	MeterFileInfo->CountFlag = METER_FILE_SYNC_TO_RAM_FLAG;	
	
	
//test start
//	On38KHz();//开38KHz时钟(TIM3_CH3)
	

//test end
}

void JZQ_II_GeneralGPIOInit(void)
{
	u32 i;
	u32 x;
	u16 *p16;
	u32 *p32;
	Terminal_Ram_TypeDef* pTerminalRam = Terminal_Ram;
	Comm_Ram_TypeDef* pCommRam = Comm_Ram;
	
	//IRAM数据清0(除显示外)
	pCommRam->ErrorIC |= RAM_Test(ADDR_TerminalDisplay_IRAM_End, ADDR_Terminal_IRAM_End - ADDR_TerminalDisplay_IRAM_End);//RAM测试;返回:0=正确,1=错误

	//ERAM数据清0
	p32 = (u32*)ADDR_SDRAM_CLR_START;
	x = ADDR_ERAM_END - ADDR_SDRAM_CLR_START;
	x /= 4;
	for(i = 0; i < x; i++)
	{
		p32[i] = 0;		//err20180529 笔误 原为p32[0] 未对ERAM数据区初始化 导致周期抄表存储的数据错误(目前只在II型集中器中出现错误情况)
		
