gdgly/NUC97X_JS/STM32F4xx/CSG/TerminalCSG/Terminal_Init.c
	}
	pTerminalRam->S_PR = 60;			// 60秒分频产生分
	pCommRam->BattWork_S_timer = 30;	// 电池工作关机秒定时器

	// 以下只有在电网有电时进行
	if(pCommRam->POWER < 3)	return;		// 电源:0=电池供电,1=电网供电转电池供电重启动,2=电网供电转电池供电,3=电网供电
	
//引脚初始化
	Pin_Configure(PIN_UART5_OE,	//抄表 485_1 收发控制
					0|//B3-B0:复用功能选择AF(0-15)
		 (1<<4)|//B5-B4:模式:00：输入（复位状态）,01：通用输出模式,10：复用功能模式,11：模拟模式
		 (0<<6)|//B6   :输出类型:0：输出推挽（复位状态）,1：输出开漏
		 (0<<7)|//B8-B7:输出速度:00：2 MHz（低速）,01：25 MHz（中速）,10：50 MHz（快速）,11：30 pF 时为 100 MHz（高速）（15 pF 时为 80 MHz 输出（最大速度））
		 (0<<9)|//B10-B9:上拉/下拉:00：无上拉或下拉,01：上拉,10：下拉,11：保留
		 (0<<11));//B11  :当为输出时：0=输出0,1=输出1
	Pin_Configure(PIN_UART7_OE,	//抄表 485_2 收发控制
					0|//B3-B0:复用功能选择AF(0-15)
		 (1<<4)|//B5-B4:模式:00：输入（复位状态）,01：通用输出模式,10：复用功能模式,11：模拟模式
		 (0<<6)|//B6   :输出类型:0：输出推挽（复位状态）,1：输出开漏
		 (0<<7)|//B8-B7:输出速度:00：2 MHz（低速）,01：25 MHz（中速）,10：50 MHz（快速）,11：30 pF 时为 100 MHz（高速）（15 pF 时为 80 MHz 输出（最大速度））
		 (0<<9)|//B10-B9:上拉/下拉:00：无上拉或下拉,01：上拉,10：下拉,11：保留
		 (0<<11));//B11  :当为输出时：0=输出0,1=输出1	 
	Pin_Configure(PIN_ENR5V0,
					0|//B3-B0:复用功能选择AF(0-15)
		 (1<<4)|//B5-B4:模式:00：输入（复位状态）,01：通用输出模式,10：复用功能模式,11：模拟模式
		 (0<<6)|//B6   :输出类型:0：输出推挽（复位状态）,1：输出开漏
		 (0<<7)|//B8-B7:输出速度:00：2 MHz（低速）,01：25 MHz（中速）,10：50 MHz（快速）,11：30 pF 时为 100 MHz（高速）（15 pF 时为 80 MHz 输出（最大速度））
		 (0<<9)|//B10-B9:上拉/下拉:00：无上拉或下拉,01：上拉,10：下拉,11：保留
		 (0<<11));//B11  :当为输出时：0=输出0,1=输出1
	OffR5V0();		// 打开GPRS电源
	Pin_Configure(PIN_GPRS_PCTRL,//输出
					0|//B3-B0:复用功能选择AF(0-15)
		 (1<<4)|//B5-B4:模式:00：输入（复位状态）,01：通用输出模式,10：复用功能模式,11：模拟模式
		 (0<<6)|//B6   :输出类型:0：输出推挽（复位状态）,1：输出开漏
		 (0<<7)|//B8-B7:输出速度:00：2 MHz（低速）,01：25 MHz（中速）,10：50 MHz（快速）,11：30 pF 时为 100 MHz（高速）（15 pF 时为 80 MHz 输出（最大速度））
		 (1<<9)|//B10-B9:上拉/下拉:00：无上拉或下拉,01：上拉,10：下拉,11：保留
		 (0<<11));//B11  :当为输出时：0=输出0,1=输出1
	Pin_Configure(PIN_RST_GPRS,//输入
					0|//B3-B0:复用功能选择AF(0-15)
		 (1<<4)|//B5-B4:模式:00：输入（复位状态）,01：通用输出模式,10：复用功能模式,11：模拟模式
		 (0<<6)|//B6   :输出类型:0：输出推挽（复位状态）,1：输出开漏
		 (0<<7)|//B8-B7:输出速度:00：2 MHz（低速）,01：25 MHz（中速）,10：50 MHz（快速）,11：30 pF 时为 100 MHz（高速）（15 pF 时为 80 MHz 输出（最大速度））
		 (1<<9)|//B10-B9:上拉/下拉:00：无上拉或下拉,01：上拉,10：下拉,11：保留
		 (0<<11));//B11  :当为输出时：0=输出0,1=输出1
	Pin_Configure(PIN_ON_GPRS,//输出
					0|//B3-B0:复用功能选择AF(0-15)
		 (1<<4)|//B5-B4:模式:00：输入（复位状态）,01：通用输出模式,10：复用功能模式,11：模拟模式
		 (0<<6)|//B6   :输出类型:0：输出推挽（复位状态）,1：输出开漏
		 (0<<7)|//B8-B7:输出速度:00：2 MHz（低速）,01：25 MHz（中速）,10：50 MHz（快速）,11：30 pF 时为 100 MHz（高速）（15 pF 时为 80 MHz 输出（最大速度））
		 (1<<9)|//B10-B9:上拉/下拉:00：无上拉或下拉,01：上拉,10：下拉,11：保留
		 (0<<11));//B11  :当为输出时：0=输出0,1=输出1
	/*Pin_Configure(PIN_ENUSB5V0,
					0|//B3-B0:复用功能选择AF(0-15)
		 (1<<4)|//B5-B4:模式:00：输入（复位状态）,01：通用输出模式,10：复用功能模式,11：模拟模式
		 (0<<6)|//B6   :输出类型:0：输出推挽（复位状态）,1：输出开漏
		 (0<<7)|//B8-B7:输出速度:00：2 MHz（低速）,01：25 MHz（中速）,10：50 MHz（快速）,11：30 pF 时为 100 MHz（高速）（15 pF 时为 80 MHz 输出（最大速度））
		 (0<<9)|//B10-B9:上拉/下拉:00：无上拉或下拉,01：上拉,10：下拉,11：保留
		 (1<<11));//B11  :当为输出时：0=输出0,1=输出1
	OnUSB5V0();		// 打开USB电源
	*/
	Pin_Configure(PIN_GPRS_ID1,//输入有上拉
					0|//B3-B0:复用功能选择AF(0-15)
		 (0<<4)|//B5-B4:模式:00：输入（复位状态）,01：通用输出模式,10：复用功能模式,11：模拟模式
		 (0<<6)|//B6   :输出类型:0：输出推挽（复位状态）,1：输出开漏
		 (0<<7)|//B8-B7:输出速度:00：2 MHz（低速）,01：25 MHz（中速）,10：50 MHz（快速）,11：30 pF 时为 100 MHz（高速）（15 pF 时为 80 MHz 输出（最大速度））
		 (1<<9)|//B10-B9:上拉/下拉:00：无上拉或下拉,01：上拉,10：下拉,11：保留
		 (0<<11));//B11  :当为输出时：0=输出0,1=输出1
	Pin_Configure(PIN_GPRS_ID2,//输入有上拉
					0|//B3-B0:复用功能选择AF(0-15)
		 (0<<4)|//B5-B4:模式:00：输入（复位状态）,01：通用输出模式,10：复用功能模式,11：模拟模式
		 (0<<6)|//B6   :输出类型:0：输出推挽（复位状态）,1：输出开漏
		 (0<<7)|//B8-B7:输出速度:00：2 MHz（低速）,01：25 MHz（中速）,10：50 MHz（快速）,11：30 pF 时为 100 MHz（高速）（15 pF 时为 80 MHz 输出（最大速度））
		 (1<<9)|//B10-B9:上拉/下拉:00：无上拉或下拉,01：上拉,10：下拉,11：保留
		 (0<<11));//B11  :当为输出时：0=输出0,1=输出1
	Pin_Configure(PIN_GPRS_ID3,//输入有上拉
					0|//B3-B0:复用功能选择AF(0-15)
		 (0<<4)|//B5-B4:模式:00：输入（复位状态）,01：通用输出模式,10：复用功能模式,11：模拟模式
		 (0<<6)|//B6   :输出类型:0：输出推挽（复位状态）,1：输出开漏
		 (0<<7)|//B8-B7:输出速度:00：2 MHz（低速）,01：25 MHz（中速）,10：50 MHz（快速）,11：30 pF 时为 100 MHz（高速）（15 pF 时为 80 MHz 输出（最大速度））
		 (1<<9)|//B10-B9:上拉/下拉:00：无上拉或下拉,01：上拉,10：下拉,11：保留
		 (0<<11));//B11  :当为输出时：0=输出0,1=输出1

	Pin_Configure(PIN_RUNLED,//上电时检查指示LED故初始输出0(亮)
					0|//B3-B0:复用功能选择AF(0-15)
		 (1<<4)|//B5-B4:模式:00：输入（复位状态）,01：通用输出模式,10：复用功能模式,11：模拟模式
		 (0<<6)|//B6   :输出类型:0：输出推挽（复位状态）,1：输出开漏
		 (0<<7)|//B8-B7:输出速度:00：2 MHz（低速）,01：25 MHz（中速）,10：50 MHz（快速）,11：30 pF 时为 100 MHz（高速）（15 pF 时为 80 MHz 输出（最大速度））
		 (0<<9)|//B10-B9:上拉/下拉:00：无上拉或下拉,01：上拉,10：下拉,11：保留
		 (0<<11));//B11  :当为输出时：0=输出0,1=输出1
	Pin_Configure(PIN_ATTR_LED,//上电时检查指示LED故初始输出0(亮)
					0|//B3-B0:复用功能选择AF(0-15)
		 (1<<4)|//B5-B4:模式:00：输入（复位状态）,01：通用输出模式,10：复用功能模式,11：模拟模式
		 (0<<6)|//B6   :输出类型:0：输出推挽（复位状态）,1：输出开漏
		 (0<<7)|//B8-B7:输出速度:00：2 MHz（低速）,01：25 MHz（中速）,10：50 MHz（快速）,11：30 pF 时为 100 MHz（高速）（15 pF 时为 80 MHz 输出（最大速度））
		 (0<<9)|//B10-B9:上拉/下拉:00：无上拉或下拉,01：上拉,10：下拉,11：保留
		 (0<<11));//B11  :当为输出时：0=输出0,1=输出1
	Pin_Configure(PIN_RS485T1_LED,//抄表485_1LED
					0|//B3-B0:复用功能选择AF(0-15)
		 (1<<4)|//B5-B4:模式:00：输入（复位状态）,01：通用输出模式,10：复用功能模式,11：模拟模式
		 (0<<6)|//B6   :输出类型:0：输出推挽（复位状态）,1：输出开漏
		 (0<<7)|//B8-B7:输出速度:00：2 MHz（低速）,01：25 MHz（中速）,10：50 MHz（快速）,11：30 pF 时为 100 MHz（高速）（15 pF 时为 80 MHz 输出（最大速度））
		 (0<<9)|//B10-B9:上拉/下拉:00：无上拉或下拉,01：上拉,10：下拉,11：保留
		 (0<<11));//B11  :当为输出时：0=输出0,1=输出1
	Pin_Configure(PIN_RS485R1_LED,//抄表485_1LED
					0|//B3-B0:复用功能选择AF(0-15)
		 (1<<4)|//B5-B4:模式:00：输入（复位状态）,01：通用输出模式,10：复用功能模式,11：模拟模式
		 (0<<6)|//B6   :输出类型:0：输出推挽（复位状态）,1：输出开漏
		 (0<<7)|//B8-B7:输出速度:00：2 MHz（低速）,01：25 MHz（中速）,10：50 MHz（快速）,11：30 pF 时为 100 MHz（高速）（15 pF 时为 80 MHz 输出（最大速度））
		 (0<<9)|//B10-B9:上拉/下拉:00：无上拉或下拉,01：上拉,10：下拉,11：保留
		 (0<<11));//B11  :当为输出时：0=输出0,1=输出1
	Pin_Configure(PIN_GPRSTX_LED,//GPRS数据发送灯
					0|//B3-B0:复用功能选择AF(0-15)
		 (1<<4)|//B5-B4:模式:00：输入（复位状态）,01：通用输出模式,10：复用功能模式,11：模拟模式
		 (0<<6)|//B6   :输出类型:0：输出推挽（复位状态）,1：输出开漏
		 (0<<7)|//B8-B7:输出速度:00：2 MHz（低速）,01：25 MHz（中速）,10：50 MHz（快速）,11：30 pF 时为 100 MHz（高速）（15 pF 时为 80 MHz 输出（最大速度））
		 (0<<9)|//B10-B9:上拉/下拉:00：无上拉或下拉,01：上拉,10：下拉,11：保留
		 (0<<11));//B11  :当为输出时：0=输出0,1=输出1
	Pin_Configure(PIN_GPRSRX_LED,//GPRS数据接收灯
					0|//B3-B0:复用功能选择AF(0-15)
		 (1<<4)|//B5-B4:模式:00：输入（复位状态）,01：通用输出模式,10：复用功能模式,11：模拟模式
		 (0<<6)|//B6   :输出类型:0：输出推挽（复位状态）,1：输出开漏
		 (0<<7)|//B8-B7:输出速度:00：2 MHz（低速）,01：25 MHz（中速）,10：50 MHz（快速）,11：30 pF 时为 100 MHz（高速）（15 pF 时为 80 MHz 输出（最大速度））
		 (0<<9)|//B10-B9:上拉/下拉:00：无上拉或下拉,01：上拉,10：下拉,11：保留
		 (0<<11));//B11  :当为输出时：0=输出0,1=输出1
	Pin_Configure(PIN_LED_ONLINE,//GPRS在线灯
					0|//B3-B0:复用功能选择AF(0-15)
		 (1<<4)|//B5-B4:模式:00：输入（复位状态）,01：通用输出模式,10：复用功能模式,11：模拟模式
		 (0<<6)|//B6   :输出类型:0：输出推挽（复位状态）,1：输出开漏
		 (0<<7)|//B8-B7:输出速度:00：2 MHz（低速）,01：25 MHz（中速）,10：50 MHz（快速）,11：30 pF 时为 100 MHz（高速）（15 pF 时为 80 MHz 输出（最大速度））
		 (0<<9)|//B10-B9:上拉/下拉:00：无上拉或下拉,01：上拉,10：下拉,11：保留
		 (0<<11));//B11  :当为输出时：0=输出0,1=输出1		 
//	Pin_Configure(PIN_ATTR_LED,//告警指示灯
//					0|//B3-B0:复用功能选择AF(0-15)
//		 (1<<4)|//B5-B4:模式:00：输入（复位状态）,01：通用输出模式,10：复用功能模式,11：模拟模式
//		 (0<<6)|//B6   :输出类型:0：输出推挽（复位状态）,1：输出开漏
//		 (0<<7)|//B8-B7:输出速度:00：2 MHz（低速）,01：25 MHz（中速）,10：50 MHz（快速）,11：30 pF 时为 100 MHz（高速）（15 pF 时为 80 MHz 输出（最大速度））
//		 (0<<9)|//B10-B9:上拉/下拉:00：无上拉或下拉,01：上拉,10：下拉,11：保留
//		 (0<<11));//B11  :当为输出时：0=输出0,1=输出1
	Pin_Configure(PIN_STRONG_SINGLE,//远程通道信号强度最强灯
					0|//B3-B0:复用功能选择AF(0-15)
		 (1<<4)|//B5-B4:模式:00：输入（复位状态）,01：通用输出模式,10：复用功能模式,11：模拟模式
		 (0<<6)|//B6   :输出类型:0：输出推挽（复位状态）,1：输出开漏
		 (0<<7)|//B8-B7:输出速度:00：2 MHz（低速）,01：25 MHz（中速）,10：50 MHz（快速）,11：30 pF 时为 100 MHz（高速）（15 pF 时为 80 MHz 输出（最大速度））
		 (0<<9)|//B10-B9:上拉/下拉:00：无上拉或下拉,01：上拉,10：下拉,11：保留
		 (0<<11));//B11  :当为输出时：0=输出0,1=输出1
	Pin_Configure(PIN_WEAK_SINGLE,//远程通道信号强度最弱灯
					0|//B3-B0:复用功能选择AF(0-15)
		 (1<<4)|//B5-B4:模式:00：输入（复位状态）,01：通用输出模式,10：复用功能模式,11：模拟模式
		 (0<<6)|//B6   :输出类型:0：输出推挽（复位状态）,1：输出开漏
		 (0<<7)|//B8-B7:输出速度:00：2 MHz（低速）,01：25 MHz（中速）,10：50 MHz（快速）,11：30 pF 时为 100 MHz（高速）（15 pF 时为 80 MHz 输出（最大速度））
		 (0<<9)|//B10-B9:上拉/下拉:00：无上拉或下拉,01：上拉,10：下拉,11：保留
		 (0<<11));//B11  :当为输出时：0=输出0,1=输出1
	
		 
	MC(0,ADDR_TerminalRealTimer,1);						// 0 = 掉电时间未计算, 1 = 掉电时间已计算
	pTerminalRam->SlipCYC_S_Timer = 60;					// 23 终端输入脉冲功率计算和需量脉冲滑移秒定时器
	pTerminalRam->Power_S_Timer = 10;					// 38 停电事件秒定时器
	p16 = (u16 *)Get_ADDR_UARTnTimer_S(RS485_1PORT);
	p16[0] = 10;										// 10秒上电后延时抄表
	p16 = (u16 *)Get_ADDR_UARTnTimer_S(RS485_2PORT);
	p16[0] = 10;										// 10秒上电后延时抄表
	

	pTerminalRam->RS485_1_TxLED_MS_Timer=2000/10;		// 10 RS485_1抄表发送LED指示MS定时器,每10MS减1定时器
	pTerminalRam->RS485_1_RxLED_MS_Timer=2000/10;		// 11 RS485_1抄表接收LED指示MS定时器,每10MS减1定时器
	pTerminalRam->RS485_2_TxLED_MS_Timer=2000/10;		// 12 RS485_2抄表发送LED指示MS定时器,每10MS减1定时器
	pTerminalRam->RS485_2_RxLED_MS_Timer=2000/10;		// 13 RS485_2抄表接收LED指示MS定时器,每10MS减1定时器
	pTerminalRam->GPRS_RxLED_MS_Timer = 2000/10;		//8   GPRS 接收LED 10MS定时器
	pTerminalRam->GPRS_TxLED_MS_Timer = 2000/10;    //9 	GPRS 发送LED 10MS定时器
	pTerminalRam->GPRS_ONLINELED_MS_Timer = 2000/10;        //19 GPRS在线LED指示MS定时器,每10MS减1定时器
	pTerminalRam->GPRS_WEAK_SINGLE_LED_MS_Timer = 2000/10;  //20 GPRS信号最弱LED指示MS定时器,每10MS减1定时器
	pTerminalRam->GPRS_STRONG_SINGLE_LED_MS_Timer= 2000/10; //21 GPRS信号最强LED指示MS定时器,每10MS减1定时器
	
	pCommRam->CheckLEDTimer = 3000/10;					// 上电全部LED检查显示 每10MS减1定时器
}

#endif




void Terminal_Reset_Count(void)
{
	TerminalRunTimeCtrlStruct* pTSysCtrl = (TerminalRunTimeCtrlStruct*)ADDR_Terminal_RunTime;
	u32 ResetCnt = 0;
	//u32 i = 0;
	//u32* p32;
	MR((u32)&ResetCnt, ADDR_TerminalResetCnt, 4);
	if(ResetCnt == 0xFFFFFFFF)
	{
		ResetCnt = 0;
		Init_ALLPara();
		MC(0, (u32)ADDR_RS485_CH1_AMR_TaskCtrl, sizeof(AMRCtrlStruct));
		MC(0, (u32)ADDR_RS485_CH2_AMR_TaskCtrl, sizeof(AMRCtrlStruct));
		MC(0, (u32)ADDR_RS485_CH3_AMR_TaskCtrl, sizeof(AMRCtrlStruct));
		MC(0, (u32)ADDR_PLC_AMR_TaskCtrl, sizeof(AMRCtrlStruct));

