gdgly/NUC97X_JS/STM32F4xx/CSG/TerminalCSG/Terminal_Init.c
		MC(0, ADDR_E1800001, 256);	
		/*
		Comm_Ram->msFILEchange=0;//文件管理数据变化:0=变化,!=没变化
		p32=(u32*)(ADDR_msFILEmanage);
		for(i=0;i<(LEN_msFILEmanage/4);i++)
		{
			p32[i]=0;
		}
		p32=(u32*)(ADDR_RAMmsFILEmanage);
		for(i=0;i<(LEN_RAMmsFILEmanage/4);i++)
		{
			p32[i]=0;
		}
		*/	
		pTSysCtrl->DayPowerDownCnt = 0;
		pTSysCtrl->DayPowerDownTime = 0;
		pTSysCtrl->MonthPowerDownCnt = 0;
		pTSysCtrl->MonthPowerDownTime = 0;

		MR(QCSG_POWER_DOWN_NUM_DAY, (u32)&pTSysCtrl->DayPowerDownCnt, 4);
		MR(QCSG_POWER_DOWN_TIME_DAY, (u32)&pTSysCtrl->DayPowerDownTime, 4);
		MR(QCSG_POWER_DOWN_NUM_MONTH, (u32)&pTSysCtrl->MonthPowerDownCnt, 4);
		MR(QCSG_POWER_DOWN_NUM_MONTH, (u32)&pTSysCtrl->MonthPowerDownTime, 4);
	}
	else
	{
		ResetCnt++;
		MW((u32)&ResetCnt, ADDR_TerminalResetCnt, 4);

		ResetCnt = 0;
		MR((u32)&ResetCnt, ADDR_E1800016, 2);
		ResetCnt = bcd_hex(ResetCnt);
		ResetCnt++;
		ResetCnt = hex_bcd(ResetCnt);
		MW((u32)&ResetCnt, ADDR_E1800016, 2);
	}
		
	pTSysCtrl->CheckMinute = 0xFF;
	pTSysCtrl->Flag |= TERMINAL_POWER_UP_FLAG;

}



/*
void Init_EnergyInc_Souser(void)//测量点电能增量计算用原始数据清为0xee
{
	u32 i;
//正向有功电能增量
	for(i=0;i<MaxRS485Pn;i++)
	{
		MC(0xee,ADDR_PKWH_INC+((1+(9*(TMaxTariff+1)))*i)+1+(4*(TMaxTariff+1)),(5*(TMaxTariff+1)));
	}
//正向无功电能增量
	for(i=0;i<MaxRS485Pn;i++)
	{
		MC(0xee,ADDR_PKVARH_INC+((1+(8*(TMaxTariff+1)))*i)+1+(4*(TMaxTariff+1)),(4*(TMaxTariff+1)));
	}
//反向有功电能增量
	for(i=0;i<MaxRS485Pn;i++)
	{
		MC(0xee,ADDR_NKWH_INC+((1+(9*(TMaxTariff+1)))*i)+1+(4*(TMaxTariff+1)),(5*(TMaxTariff+1)));
	}
//反向无功电能增量
	for(i=0;i<MaxRS485Pn;i++)
	{
		MC(0xee,ADDR_NKVARH_INC+((1+(8*(TMaxTariff+1)))*i)+1+(4*(TMaxTariff+1)),(4*(TMaxTariff+1)));
	}
}
void Init_IncRemainder(void)//总加组总加电能量增量小数位清为0x0
{
//当日总加有功电能量增量小数位(总加组号)
	MC(0x0,ADDR_AFN0CF19_Remainder,(4*(TMaxTariff+1)*AFN0CF19MaxPn));
//当日总加无功电能量增量小数位(总加组号)
	MC(0x0,ADDR_AFN0CF20_Remainder,(4*(TMaxTariff+1)*AFN0CF20MaxPn));
//当月总加有功电能量增量小数位(总加组号)
	MC(0x0,ADDR_AFN0CF21_Remainder,(4*(TMaxTariff+1)*AFN0CF21MaxPn));
//当月总加无功电能量增量小数位(总加组号)
	MC(0x0,ADDR_AFN0CF22_Remainder,(4*(TMaxTariff+1)*AFN0CF22MaxPn));
//终端当前剩余电量(费)增量小数位(总加组号)
	MC(0x0,ADDR_AFN0CF23_Remainder,(4*(TMaxTariff+1)*AFN0CF23MaxPn));
}
*/
/*
void Init_ReadMeter(void)//抄表初始化
{
  UARTCtrl_TypeDef * UARTCtrl;
	
	Terminal_Ram->ACSampleRM_S_Timer=0;
	Terminal_Ram->RS4851RM_S_Timer=0;
	Terminal_Ram->RS4852RM_S_Timer=0;
	Terminal_Ram->RS4853RM_S_Timer=0;
	if(Get_LEN_UARTnCtrl(ACSAMPLEPORT)!=0)
	{
		UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(ACSAMPLEPORT);
		UARTCtrl->MeterNo=0;//电能表/交流采样装置序号(半字对齐)
		UARTCtrl->FnCount=0;//Fn计数
		UARTCtrl->RMCount=0;//抄表命令计数
	}
	if(Get_LEN_UARTnCtrl(RS485_1PORT)!=0)
	{
		UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(RS485_1PORT);
		UARTCtrl->MeterNo=0;//电能表/交流采样装置序号(半字对齐)
		UARTCtrl->FnCount=0;//Fn计数
		UARTCtrl->RMCount=0;//抄表命令计数
	}
	if(Get_LEN_UARTnCtrl(RS485_2PORT)!=0)
	{
		UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(RS485_2PORT);
		UARTCtrl->MeterNo=0;//电能表/交流采样装置序号(半字对齐)
		UARTCtrl->FnCount=0;//Fn计数
		UARTCtrl->RMCount=0;//抄表命令计数
	}
	if(Get_LEN_UARTnCtrl(RS485_3PORT)!=0)
	{
		UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(RS485_3PORT);
		UARTCtrl->MeterNo=0;//电能表/交流采样装置序号(半字对齐)
		UARTCtrl->FnCount=0;//Fn计数
		UARTCtrl->RMCount=0;//抄表命令计数
	}
}
*/

void Init_CSG(u8 Init_Mode)
{
	TerminalRunTimeCtrlStruct* pTSysCtrl = (TerminalRunTimeCtrlStruct*)ADDR_Terminal_RunTime;
	ms_Type *ms;
	CommunicationParaStruct CommPara;
	CommunicationParaStruct CommPara_Temp;
	//u32 i = 0;
	//AlarmSaveParaStruct AlarmSavePara;//err20190216 修改掉电存储标志的存储位置

	switch (Init_Mode)
	{
		case 0:
			break;
		case 1:
			DataResetAction(2,RS232PORT);//硬件复位
			break;
		case 2:
			DataResetAction(1,RS232PORT);//数据区初始化
			break;
		case 3:							//所有参数及数据区初始化
			MC(0, (u32)&CommPara_Temp, sizeof(CommunicationParaStruct));
			MR((u32)&CommPara_Temp, ADDR_CommunicationPara, sizeof(CommunicationParaStruct));
			ME(ADDR_TERMINAL_PARA_START, 128*1024);
			ME(ADDR_MP_START, 256*1024);
			Init_ALLPara();
			MR((u32)&CommPara, ADDR_CommunicationPara, sizeof(CommunicationParaStruct));
			CommPara.TerminalAddr = CommPara_Temp.TerminalAddr;
			CommPara.TerminalLocationCode = CommPara_Temp.TerminalLocationCode;
			MW((u32)&CommPara, ADDR_CommunicationPara, sizeof(CommunicationParaStruct));
			ms = Get_ms();
			/*MaxFileName = FILENAMEmax_FLASH;
			for(i = 0; i < MaxFileName; i++)
			{
				ms->msfile_Delete(i);
				checkFile(i);
				pCommRam->msFILEchange = 0;
			}*/
			ms->msfile_format();
			MC(0, ADDR_E1800001, 256);
			QCSG_ClearStatisticsData();
			pTSysCtrl->DayPowerDownCnt = 0;
			pTSysCtrl->DayPowerDownTime = 0;
			pTSysCtrl->MonthPowerDownCnt = 0;
			pTSysCtrl->MonthPowerDownTime = 0;
			pTSysCtrl->LastAlarmDI = 0;
			pTSysCtrl->LatelyAlarmNum = 0;	
			pTSysCtrl->GPRSRxTxBytes = 0;//err20180404-20 通信流量清空
			MC(0, ADDR_RS485_CH1_AMR_TaskCtrl, LEN_RS485_CH1_AMR_TaskCtrl * 4);
			
			//MC(0, ADDR_GUIPASSWORD, 4);//菜单初始密码为0
			break;
		case 4:
		case 5:
			DataResetAction(0,RS232PORT);//除通信参数外所有参数及数据区初始化
			break;
		default:
			DataResetAction(2,RS232PORT);//硬件复位
			break;
			
	}
}



#include "../GPRS/ATNo.h"
void Init_Terminal_SoftwareUpdate(void)//软件更新初始化
{
	TerminalRunTimeCtrlStruct* pTsysCtrl = (TerminalRunTimeCtrlStruct*)ADDR_Terminal_RunTime; 

	Init_CSG(Terminal_UpDataInit);
	
	pTsysCtrl->Flag = 0;
	
	//MS在BOOT更新,可能因选择NAND128kBuff和NAND4kBuff不同,数据保护恢复可能错误,故在此先将数据写入FLASH
#if NAND128kBuff==0//定义128k nand写缓冲;0=4k BKPSRAM,1=128k SDRAM
 NAND4kBuff_Write_NAND(ADDR_DATABUFF,ADDR_Download_ENTRY,0);//连同4K(BKPSRAM)缓冲数据写到NAND FLASH
#else
 NAND128kBuff_Write_NAND(ADDR_DATABUFF,ADDR_Download_ENTRY,0);//连同128K(BKPSDRAM)缓冲数据写到NAND FLASH
#endif 
}




